[
  {
    "id": "00000000-0000-0000-0000-000000000001",
    "title": "IEEE X ASME",
    "slug": "intro-to-computer-vision",
    "date": "2025-11-17T15:00:00Z",
    "category": "Upcoming Event",
    "short": "Explore robotics and computer vision",
"description": "<p>Dive into OpenCV, image processing, and hands-on robotics applications.</p><p>Register here: <a href='https://forms.gle/YOUR_GOOGLE_FORM_LINK' target='_blank' style='color: blue; font-weight: bold;'>Click Here</a></p>",
    "coverImage": "/uploads/covers/cs.png",
    "gallery": [
    ],
    "featured": true,
    "createdAt": "2026-01-01T12:00:00Z"
  },
  {
    "id": "00000000-0000-0000-0000-000000000002",
    "title": "IEEE X IEI",
    "slug": "ai-ethics-talk",
    "date": "2025-10-15T18:00:00Z",
    "category": "Talk",
    "short": "Innovative AI problem-solving",
   "description": "<h3>Diffuse It If U Can – IEEE X IEI</h3><p>The IEEE BPDC Student Branch, in collaboration with the <strong>Institution of Engineers (India) [IEI]</strong>, organized an exciting and intellectually engaging event titled <em>“Diffuse It If U Can.”</em> This innovative competition seamlessly combined elements of logical reasoning, problem-solving, and embedded systems, offering participants a unique hands-on experience unlike any other.</p><p>A total of 45 teams participated in the challenge. Each team was presented with a simulated “bomb” setup connected to an Arduino board through four wires. To safely “diffuse” the bomb, participants had to solve a series of riddles—each clue leading to the identification of the correct wire to cut. The task tested both their analytical skills and ability to perform under time pressure.</p><p>The atmosphere was electric as teams raced against the clock, applying quick thinking and precise coordination to complete the challenge successfully. The fastest teams to diffuse their circuits achieved impressive times of 103 seconds and 107 seconds, securing the top two positions respectively.</p><p>As a paid event, <em>Diffuse It If U Can</em> drew significant attention and participation from students across various disciplines, highlighting its innovative concept and engaging execution. The collaboration between IEEE and IEI was widely appreciated, demonstrating the power of interdisciplinary teamwork and creative learning.</p><p>The event concluded on a highly positive note, with participants praising its originality, technical relevance, and excitement. It stood out as one of the most inventive and well-received competitions of the semester, embodying IEEE BPDC’s spirit of learning through innovation and collaboration.</p>",
    "coverImage": "/uploads/covers/ieeexiei.jpg",
    "gallery": [
    ],
    "featured": true,
    "createdAt": "2026-01-12T10:00:00Z"
  },
  {
    "id": "00000000-0000-0000-0000-000000000003",
    "title": "Expert Talk on Turning Ideas into Patents",
    "slug": "online-talk",
    "date": "2025-10-10T16:00:00Z",
    "category": "Talk",
    "short": "Learn to protect your innovations",
    "description": "<h3>Expert Talk on Turning Ideas into Patents</h3><p>The IEEE BPDC Student Branch, in collaboration with the <strong>Alumni Relations Cell</strong>, organized an insightful online session titled <em>“Turning Ideas into Patents.”</em> The talk was conducted by <strong>Mr. Kartikay Singh</strong>, a distinguished patent attorney and BITS alumnus, who shared his expertise on intellectual property rights and the process of transforming innovative ideas into legally recognized patents.</p><p>Mr. Singh began the session by demystifying the fundamentals of patent law and intellectual property protection, offering participants a clear understanding of how innovation can be safeguarded. He then guided attendees through the step-by-step process of drafting and filing a patent — from evaluating the novelty of an idea and preparing the documentation, to understanding the legal procedures involved in national and international filings.</p><p>Throughout the session, Mr. Singh enriched the discussion with practical examples from his professional experience, helping students grasp the nuances of patent search, originality assessment, and claim writing. His talk also shed light on the strategic importance of patents in research, entrepreneurship, and technology development.</p><p>The event was conducted free of charge and attracted enthusiastic participation from students across disciplines. The engaging <strong>Q&amp;A session</strong> that followed allowed attendees to clarify doubts and seek advice on protecting their own innovations.</p><p>The talk proved to be both inspiring and informative, equipping students with valuable knowledge on intellectual property and reinforcing <strong>IEEE BPDC’s</strong> commitment to promoting innovation, awareness, and professional growth among its members.</p>",
    "coverImage": "/uploads/covers/talkpatents.jpg",
    "gallery": [

    ],
    "featured": true,
    "createdAt": "2026-02-01T09:00:00Z"
  },
  {
    "id": "00000000-0000-0000-0000-000000000004",
    "title": "Expert Talk on Electronic System Design Approaches",
    "slug": "quantum-computing-101",
    "date": "2025-10-02T09:30:00Z",
    "category": "Talk",
    "short": "From Embedded Systems to SoC Design",
    "description": "The IEEE BPDC Student Branch had the privilege of hosting a distinguished lecture by <strong>Prof. Bishnu Prasad Das</strong> from <strong>IIT Roorkee</strong> on the theme “Electronic System Design Approaches: Embedded Systems to SoC Design.” The session was attended by 25 participants, comprising students and faculty with keen interests in embedded systems, VLSI design, and advanced semiconductor technologies.</p><p>Prof. Das opened the session with an overview of contemporary design methodologies in embedded systems, gradually building the discussion towards <strong>System-on-Chip (SoC) architecture</strong>. He highlighted the evolution of design flows, emphasizing their role in bridging hardware and software integration. The talk further delved into the pressing demand for skilled professionals in the field of <strong>VLSI design</strong>, offering valuable insights into the semiconductor industry’s future prospects.</p><p>Drawing on his extensive expertise, Prof. Das also shared details of the chips he has personally designed, providing the audience with a rare opportunity to understand real-world applications and challenges in cutting-edge research. His ability to connect academic concepts with industry relevance made the lecture both enlightening and inspiring.</p><p>The event concluded with an interactive <strong>Q&amp;A session</strong>, where attendees engaged Prof. Das on topics ranging from design complexities to career prospects in VLSI and SoC development. The session was met with highly positive feedback, with participants appreciating the depth of technical knowledge shared in a concise and accessible manner.</p><p>This expert talk stands as a testament to <strong>IEEE BPDC’s</strong> continued commitment to fostering advanced learning opportunities and connecting students with eminent scholars and practitioners in the field.</p>",

    "coverImage": "/uploads/covers/talksocdesign.jpg",
    "gallery": [
    ],
    "featured": true,
    "createdAt": "2026-03-10T09:00:00Z"
  },
  {
    "id": "00000000-0000-0000-0000-000000000005",
    "title": "IEEE Sustainathon 2025",
    "slug": "sustainathon",
    "date": "2026-09-19T09:30:00Z",
    "category": "Hackathon",
    "short": "Innovate, pitch, and prototype solutions",
"description": "<h4>Introduction</h4><p>The IEEE Student Branch of BITS Pilani Dubai Campus successfully hosted <strong>Sustainathon 2025</strong>, a flagship hackathon designed to foster innovation and sustainable problem-solving. The event brought together enthusiastic students, expert mentors, and distinguished judges for a day of creativity, collaboration, and impactful learning.</p><hr><h4>Objectives</h4><ul><li>To encourage students to design and develop sustainable technological solutions.</li><li>To provide participants with hands-on exposure to tools such as Figma and AI-based platforms.</li><li>To foster teamwork, critical thinking, and interdisciplinary collaboration.</li><li>To recognize and reward innovative problem-solving approaches.</li></ul><hr><h4>Event Proceedings</h4><h5>Day 1 – Workshop on Figma & AI Tools</h5><ul><li><strong>Time:</strong> 12:00 PM – 1:00 PM</li><li><strong>Facilitators:</strong> Priyanshu and Manav Arya</li><li>The workshop introduced participants to UI/UX design principles using Figma, along with demonstrations of AI-powered design tools.</li><li>Participants engaged in hands-on practice, creating wireframes and mockups.</li><li>Registrations for the hackathon were also accepted on the spot, and payments were collected during the workshop.</li></ul><h5>Evening Session</h5><ul><li>The hackathon format was officially introduced. Teams were guided through rules, evaluation criteria, and submission requirements.</li><li>The ideation phase began, with participants brainstorming solutions addressing key sustainability challenges.</li></ul><h5>Hackathon – 19th September 2025</h5><ul><li>A total of 40 participants formed 13 teams.</li><li>Teams worked collaboratively throughout the day in Room 334 and the Electronics and Communication Systems Lab, refining their ideas into workable prototypes.</li><li>Mentors and organizers provided support through check-ins and progress reviews.</li></ul><h5>Final Presentations & Valedictory Ceremony</h5><ul><li>Teams presented their final solutions before a distinguished panel of judges:</li><ul><li>Prof. Dr. Jagdish Nayak</li><li>Prof. Dr. Nilesh Goel</li><li>Prof. Dr. Shazia</li><li>Prof. Dr. Ashutosh Mishra</li></ul><li>Projects were evaluated on innovation, feasibility, sustainability impact, and presentation quality.</li><li><strong>Winners:</strong></li><ul><li>1st Place: Aaryan Gupta and team – AED 200</li><li>2nd Place: Shahna and team – AED 100</li><li>3rd Place: Yuvraj and team – AED 50</li><li>Best Freshers Prize: Krishna and team – AED 50</li></ul><li>Certificates of recognition were distributed to all winners and participants.</li></ul><hr><h4>4. Participation</h4><ul><li>Total Participants: 40</li><li>Total Teams: 13</li><li>Judges: 4 esteemed faculty and experts</li></ul><hr><h4>5. Outcomes</h4><ul><li>Students gained practical exposure to UI/UX design and AI tools.</li><li>Teams developed innovative and sustainable prototypes within a competitive but collaborative environment.</li><li>The event nurtured networking, mentorship, and peer learning.</li><li>Winning projects showcased the creativity and problem-solving skills of students across different levels.</li></ul><hr><h4>6. Conclusion</h4><p><strong>Sustainathon 2025</strong> was a remarkable success, seamlessly combining workshops, mentorship, and competition. The event not only challenged participants to think innovatively about sustainability but also equipped them with practical skills and real-world perspectives. With strong engagement, expert guidance, and impactful outcomes, the IEEE Student Branch of BITS Pilani Dubai Campus continues to foster a culture of learning, innovation, and excellence.</p><hr><p><strong>Pictures:</strong></p>",
    "coverImage": "/uploads/covers/sustainathon.jpg",
    "gallery": [
      "/uploads/covers/sustainathon1.jpg"
    ],
    "featured": true,
    "createdAt": "2026-03-10T09:00:00Z"
  },
  {
    "id": "00000000-0000-0000-0000-000000000006",
    "title": "Fact or Fakecast? – AI News Challenge",
    "slug": "ai-news-challenge",
    "date": "2025-09-08T10:30:00Z",
    "category": "Stall Event",
    "short": "Spot fake news with AI",
"description": "<p>The IEEE BPDC Student Branch hosted a dynamic and thought-provoking competition titled “Fact or Fakecast? – AI News Challenge.” This interactive event was designed to test participants’ ability to distinguish between authentic news headlines and AI-generated fakes, while fostering awareness of the growing influence of artificial intelligence in media. </p><p>The challenge featured eight rounds, each consisting of three news headlines: one real and two fabricated by AI. Participants had to analyze the headlines critically and identify the real entry. A poster designed and circulated via social media channels like instagram and whatsapp with the efforts of our team played a key role in increasing our reach. With over 115 students in attendance, the event created a lively atmosphere filled with energy, curiosity, and spirited debate.</p>The top two performers, who showcased exceptional judgment and critical thinking, were awarded special gifts as recognition of their sharp instincts. Beyond the competitive excitement, the event successfully highlighted the importance of media literacy in an AI-driven era.</p> <p>The Fact or Fakecast challenge was met with enthusiastic participation and positive feedback, reinforcing IEEE BPDC’s dedication to hosting innovative events that combine technical relevance with engaging formats for students.</p>",
    "coverImage": "/uploads/covers/fact-fakecast.jpg",
    "gallery": [
      "/uploads/covers/fact-fakecast1.jpg"
    ],
    "featured": true,
    "createdAt": "2026-03-10T09:00:00Z"
  }
]
